# Користувач вводить рядок. Ваше завдання - перевірити, чи може цей рядок бути ім'ям змінної.
#
# Змінна не може:
#
# починатися з цифри
# містити великі літери,
# пробіл і знаки пунктуації (взяти можна тут string.punctuation), окрім нижнього підкреслення "_".
# бути жодним із зареєстрованих слів.
# При цьому повне ім'я змінної повино складатись не більш чим з одного нижнього підкреслення "_".
#
# Список зареєстрованих слів можна взяти із keyword.kwlist.
#
# У результаті перевірки на друк виводиться або True, якщо таке ім'я змінної допустимо, або False - якщо ні.
#
# Приклади імен змінних та результат перевірки (=> на друк виводити не потрібно :))

import keyword
import string


while True:
    name = input("Введите имя переменной (или 'exit' для выхода): ")

    if name == "exit":  # Условие выхода
        print("Программа завершена.")
        break

    if name[0].isdigit() or name in keyword.kwlist or name.count("_") > 1:
        print(False)
        # name[0].isdigit()-Проверка начинается ли имя переменной с цифры. keyword.kwlist- проверка является ли имя зарегистрованным
        # name.count("_") > 1 проверка содержит ли имя больше одного почеркивания
    elif any(c.isupper() or c in string.punctuation.replace("_", "") or c.isspace() for c in name):
        # c.isspace() Проверка на пробелы
        # c in string.punctuation.replace проверка на содержания символов пунктуации кроме одного нижнего подчеркивания
        # c.isspace() for c in name рверка есть ли в имени пробельные символы
        print(False)
    else:
        print(True)# если все проверки пройденны и имя переменной допустимо




